{
  "main": {
    "name":"CHRIS EMERFOLL",
    "description":"I am a Full-Stack Web Development Engineer.  I use react and JavaScript to develop modern and next level web applications",
    "image":"profilepic.jpg",
    "bio":"I am thrilled to be breaking into the world of creating and web development. Getting into an ever changing field where there is always room to grow and keep learning has been a goal of mine for many years now and I can not wait to see what exciting challenges and opportunities are waiting for me. During the day you will find me programming and working on projects but at night… I guess you will still find me programming, BUT when I’m not programming you can find me paddle boarding out on the lakes, rock climbing, playing card games, or just hanging out at home watching youtube with my cat and dog. At the end of the day I am pretty laid back about most things and always looking for the best way to get things done. I enjoy work that challenges me to think outside my comfort zone and try new things. I get very passionate about my projects but also about relaxing and taking time off, because if you don’t take care of yourself, it’s hard to help and take care of others.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "cemerfoll@gmail.com",
    "phone": "763-225-7536",
    "github":"https://github.com/emerfoll",
    "project":"",
    "address":{
      "street":"Downtown Minneapolis",
      "city":"Minneapolis",
      "state":"Minnesota",
      "zip": "55401"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"Chris Emerfoll Software-Developer Resume.pdf",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/chris.emerfoll",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/EmerfollChris",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/christopher-emerfoll-00691b140/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/misterfoxsir/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/Emerfoll",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Most of my skills, as of now, are JavaScript and React based but I am working on other languages and frameworks.",
    "education":[
      {
        "school":"Prime Digital Academy",
        "degree":"Full-Stack Software Engineering Certificarion",
        "graduated":"March 2021",
        "description":"Prime is a program to help students learn to become full-stack web developers. Through Prime I was able to learn: React, Javascript, Git/GitHub, jQuery, Node.js, Express.js, HTML/CSS, Bootstrap, Material-UI servers-side technologies and many other technology tools."
      }
    ],
    "work":[
      {
        "company":"Prime Digital Academy",
        "title":"Full-Stack Software Engineering Student",
        "years":"October 2020 - March 2021",
        "description":"Solo Project: Beer Book - (link below in portfolio) - For our solo projects we got to pick whatever we wanted and make a C.R.U.D. application for it. For my solo project I created a full-stack web application for users (beer lovers) to find, add, and track different kinds of beers they have tried and whether or not they enjoyed them. Technologies used: PostgreSQL, Express.js, ReactJS, Node.js, Passport.js, Redux, Redux-Saga, CSS, Material-UI, Heroku",
        "description2": "Group Project: SnowSwaps - (link below in portfolio) - The group project was our capstone project. As a group of four we took on a real client to designed and created the app they asked us to build. My group was tasked with creating a Mobile-friendly online marketplace for members of snow-loving communities to buy, sell, or browse used snow-sport equipment. Technologies used: PostgreSQL, Express.js, ReactJS, Node.js, NodeMailer.js, Passport.js, Redux, Redux-Saga, CSS, Material-UI, Heroku"
      },
      {
        "company":"Ehome LLC",
        "title":"Senior Computer Technician",
        "years":"May 2017 - November 2020",
        "description":"Collaborated with other Senior Technicians to resolve workflow issues, production speed, and traceability on units processed.",
        "description2": "Designed a program to track and examine the quality of all repairs performed by Apple or other “out-of-house” companies.",
        "description3": "Performed more complicated hardware repairs on computers. Replaced components on computers like screens, LogicBoards, ports, and other non-user replaceable parts.",
        "description4": "Interfaced with a diverse customer base multiple times daily to find the right products and resolve issues."
      
      },
      {
        "company":"Cummins Inc.",
        "title":"Assembly Line Worker",
        "years":"Aug 2016 - March 2017",
        "description":"Assembled machinery in a collaborative and fast paced work environment while maintaining a clean and organized workstation and safe work practices.",
        "description2": "Operated cranes, hoists, and other heavy machinery.",
        "description3": "Built generator engines, carburetors, oil pans, etc.",
        "description4": " "
      
      },
      {
        "company":"Nortech Systems Inc.",
        "title":"Machine Operator",
        "years":"October 2015 - July 2016",
        "description":"Examined PC boards for any defects, faulty components, insufficient soldering, and blueprint discrepancies.",
        "description2": "Set-up, programmed, and operated “pick and place” SMT machines.",
        "description3": "Directed inspection and support staff for any machine issues and machine changeovers.",
        "description4": " "
      
      },
      {
        "company":"Boston Scientific",
        "title":"Machine Operator",
        "years":"Aug 2013 - Feb 2015",
        "description":"Operated silicone injection molding and various other machines for medical devices.",
        "description2": "Directed other operators on when a model change over would occur.",
        "description3": "Examined medical device parts and products for any flaws or imperfections.",
        "description4": "Logged and tracked information into computer software for traceability."
      
      }
    ],
    "skills":[
      {
        "name":"HTML",
        "level":"90%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"JavaScript",
        "level":"75%"
      },
      {
        "name":"React.Js",
        "level":"75%"
      },
      {
        "name":"ReactNative",
        "level":"55%"
      },
      
      {
        "name":"Python",
        "level":"30%"
      },
      {
        "name":"JAVA",
        "level":"30%"
      },
      {
        "name":"PHP",
        "level":"20%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Beer Book",
        "category":"My Travel Blog for my post-university travels",
        "image":"BeerBook Screenshot.png",
        "url":"https://beer-book.herokuapp.com/#/home"
      },
      {
        "title":"SnowSwaps",
        "category":"(offline now) A fighting gear company I started",
        "image":"SnowSwaps.png",
        "url":"https://snow-swaps.herokuapp.com/#/user"
      },
      {
        "title":"Life Tracker App",
        "category":"A ReactNative app I built to keep track of 'Life Totals' in card games like 'Magic, the Gathering' and others.",
        "image":"LifeTrackerApp.png",
        "url":"https://github.com/Emerfoll/LifeTrackerApp"
      },
      {
        "title":"First Resume Website",
        "category":"An HTML, CSS, and Bootstrap based resume website I made as part of the Prime application process",
        "image":"firstWebSite.png",
        "url":"https://emerfoll.academy/"
      }
    ]
  }
}

